# BtuPerH Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..BtuPerH Property
SymbolTypeId Class See Also
---
Symbol Btu/h, indicating unit British thermal units per hour.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BtuPerH { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BtuPerH As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BtuPerH {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace